In [1]:
import pandas as pd
data = {'col_1': [3, 2, 1, 0], 'col_2': ['a', 'b', 'c', 'd']}

In [2]:
pd.DataFrame.from_dict(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [3]:
dat = {'row_1': [3, 2, 1, 0], 'row_2': ['a', 'b', 'c', 'd']}
pd.DataFrame.from_dict(dat, orient='index')

       0  1  2  3
row_1  3  2  1  0
row_2  a  b  c  d

In [4]:
pd.DataFrame.from_dict(data, orient='index',
                      columns=['A', 'B', 'C', 'D'])

       A  B  C  D
col_1  3  2  1  0
col_2  a  b  c  d

In [5]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
           'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                   'value': [50, 60, 70, 80]})

In [6]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [7]:
df2

  rkey  value
0  foo     50
1  bar     60
2  baz     70
3  foo     80

In [8]:
df1.merge(df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo       50
1  foo        1  foo       80
2  foo        5  foo       50
3  foo        5  foo       80
4  bar        2  bar       60
5  baz        3  baz       70

In [9]:
df1.merge(df2, left_on='lkey', right_on='rkey',
        suffixes=('_left', '_right'))

  lkey  value_left rkey  value_right
0  foo           1  foo           50
1  foo           1  foo           80
2  foo           5  foo           50
3  foo           5  foo           80
4  bar           2  bar           60
5  baz           3  baz           70

In [10]:
# # df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
# Traceback (most recent call last):
# ...
# ValueError: columns overlap but no suffix specified:
#     Index(['value'], dtype='object')

In [36]:
df = pd.DataFrame([[1, 2], [4, 5], [0, 8], [0, 8]], index=['cobra', 'viper', 'sidewinder', 'viper2'], columns=['max_speed', 'shield'])

In [37]:
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          0       8
viper2              0       8

In [38]:
df.loc['sidewinder']

max_speed    0
shield       8
Name: sidewinder, dtype: int64

In [39]:
df.loc[['viper', 'sidewinder']] #List of labels. Note using [[]] returns a DataFrame.

            max_speed  shield
viper               4       5
sidewinder          0       8

In [40]:
df.loc['viper', 'shield']

5

In [41]:
df.loc['cobra':'cobra', 'shield']

cobra    2
Name: shield, dtype: int64

In [43]:
df.loc[[False, False, True, True]]

            max_speed  shield
sidewinder          0       8
viper2              0       8

In [44]:
# Conditional that returns a boolean Series
df.loc[df['max_speed'] !=0]

       max_speed  shield
cobra          1       2
viper          4       5

In [45]:
df.loc[df['shield'] > 6, ['max_speed']]

            max_speed
sidewinder          0
viper2              0

In [46]:
df.loc[lambda df: df['shield'] == 8]

            max_speed  shield
sidewinder          0       8
viper2              0       8

In [47]:
df.loc[['viper', 'sidewinder'], ['shield']] = 50

In [48]:
df

            max_speed  shield
cobra               1       2
viper               4      50
sidewinder          0      50
viper2              0       8

In [49]:
df.loc['cobra'] = 10

In [50]:
df

            max_speed  shield
cobra              10      10
viper               4      50
sidewinder          0      50
viper2              0       8

In [51]:
df.loc[:, 'max_speed'] = 30

In [52]:
df

            max_speed  shield
cobra              30      10
viper              30      50
sidewinder         30      50
viper2             30       8

In [53]:
df.loc[df['shield'] > 35] = 0 
# Set value for rows matching callable condition

In [54]:
df

            max_speed  shield
cobra              30      10
viper               0       0
sidewinder          0       0
viper2             30       8

In [55]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
   index=[7, 8, 9], columns=['max_speed', 'shield'])

In [56]:
df

   max_speed  shield
7          1       2
8          4       5
9          7       8

In [57]:
df.loc[7:9]

   max_speed  shield
7          1       2
8          4       5
9          7       8

In [58]:
tuples = [
 ('cobra', 'mark i'), ('cobra', 'mark ii'),
  ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
    ('viper', 'mark ii'), ('viper', 'mark iii')
 ]
index = pd.MultiIndex.from_tuples(tuples)
values = [[12, 2], [0, 4], [10, 20],
         [1, 4], [7, 1], [16, 36]]
df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)
df

                     max_speed  shield
cobra      mark i           12       2
           mark ii           0       4
sidewinder mark i           10      20
           mark ii           1       4
viper      mark ii           7       1
           mark iii         16      36

In [60]:
df.loc['viper']

          max_speed  shield
mark ii           7       1
mark iii         16      36

In [61]:
df.loc[('cobra', 'mark ii')] #Single index tuple. Note this returns a Series.

max_speed    0
shield       4
Name: (cobra, mark ii), dtype: int64

In [62]:
df.loc['cobra', 'mark i']

max_speed    12
shield        2
Name: (cobra, mark i), dtype: int64

In [63]:
df.loc[[('cobra', 'mark ii')]]

               max_speed  shield
cobra mark ii          0       4

In [64]:
df.loc[('cobra', 'mark i'), 'shield']

2

In [66]:
df.loc[('cobra', 'mark ii'):'sidewinder']

                    max_speed  shield
cobra      mark ii          0       4
sidewinder mark i          10      20
           mark ii          1       4

In [67]:
df.loc[('cobra', 'mark i'):('viper', 'mark ii')]

                    max_speed  shield
cobra      mark i          12       2
           mark ii          0       4
sidewinder mark i          10      20
           mark ii          1       4
viper      mark ii          7       1